benchbnb/app/controllers/api/users_controller.rb

    def create
        @user = User.create(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "1Mf-P9qLgollA6hLT95oZg"], ["updated_at", "2022-02-22 22:15:48.464947"], ["id", 1]]